#!/usr/bin/env ruby

# neovim editor & dependencies
brew "neovim"
brew "tree-sitter"
brew "fd"
brew "ripgrep"

# database
brew "mysql-client"

# tools & utilities
brew "asdf"
brew "awscli"
brew "git"
brew "jq"
brew "shared-mime-info"
brew "tmux"
# https://github.com/ajeetdsouza/zoxide
brew "zoxide"
# required to install mysql2 gem, command:
# - gem install mysql2 -v '0.5.6' -- --with-openssl-dir=$(brew --prefix openssl@3) --with-ldflags=-L$(brew --prefix zstd)/lib
brew "zstd"

# fonts
cask "font-agave-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
